Revit 2026 API

# Transform1DGetInverse Method

---

Gets the inverse transformation of this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform1D GetInverse()
```
```vb
Public Function GetInverse As Transform1D
```
```cpp
public:
Transform1D^ GetInverse()
```
```fsharp
member GetInverse : unit -> Transform1D
```

#### Return Value

Transform1D

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This transformation is singular. |

The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).

#### Reference

Transform1D Class

Autodesk.Revit.DB Namespace